# SystemClassification Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkIterator..::..SystemClassification Property
MEPNetworkIterator Class See Also
---
The optional MEP system classification where the iterations are restricted.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public MEPSystemClassification SystemClassification { get; set; }
```

Visual Basic
---
```text
Public Property SystemClassification As MEPSystemClassification
	Get
	Set
```

Visual C++
---
```text
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
	void set (MEPSystemClassification value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace